Repository: Sententiaregum/Sententiaregum
Catalog: src/AppBundle/Resources/translations/validators.*.xliff
Languages: de

# VALIDATORS_REGISTRATION_USERNAME_TAKEN
source: The username "%value%" is already taken!
de: Der Benutzername "%value%" wird bereits genutzt!

# VALIDATORS_REGISTRATION_USERNAME_BLANK
source: The username must not be blank!
de: Der Benutzername darf nicht leer sein!

# VALIDATORS_REGISTRATION_USERNAME_TOO_SHORT
source: The username should have at least three characters!
de: Der Benutzername muss mindestens 3 Zeichen haben!

# VALIDATORS_REGISTRATION_USERNAME_TOO_LONG
source: The maximum username length is 50!
de: Der Benutzername darf maximal 50 Zeichen haben!

# VALIDATORS_REGISTRATION_USERNAME_PATTERN
source: A username can contain alphanumeric characters and the special characters dot, underscore and dash!
de: Der Benutzername darf nur aus Alphanumerischen Zeichen (außgenommen Umlaute und das scharfe S), sowie Unterstrichen, Bindestrichen und Punkten bestehen!

# VALIDATORS_REGISTRATION_LOCALE
source: The locale of the new user is invalid!
de: Die Sprache ist ungültig!

# VALIDATORS_REGISTRATION_EMAIL_TAKEN
source: Email address "%value%" is already in use!
de: Die Email Adresse "%value%" wird bereits genutzt!

# VALIDATORS_REGISTRATION_PASSWORD_EMPTY
source: The password cannot be empty!
de: Das Passwort darf nicht leer sein!

# VALIDATORS_REGISTRATION_PASSWORD_MIN
source: The password should have at least four characters!
de: Das Passwort sollte mindestens 4 Zeichen haben!

# VALIDATORS_REGISTRATION_PASSWORD_MAX
source: The maximum password length is 4096!
de: Die maximale Passwortlänge beträgt 4096 Zeichen!

# VALIDATORS_REGISTRATION_INVALID_EMAIL
source: The email is invalid!
de: Die Email Adresse ist ungültig!

# VALIDATORS_REGISTRATION_EMAIL_EMPTY
source: The email cannot be empty!
de: Die Email darf nicht leer sein!

# VALIDATORS_REGISTRATION_CAPTCHA_INVALID
source: The captcha was invalid!
de: Das Captcha war nicht gültig!
